import type { QuestionItem } from "./SupportPopup.types";

export const supportPopupQuestions: QuestionItem[] = [
  {
    question: "מה זה טופס?",
    answer:
      "טופס הוא התבנית שלפיה אוספים מידע במערכת.\nבתוך הטופס מגדירים את השדות שהמשתמשים ימלאו, למשל שם, תאריך, סטטוס, קובץ או בחירה מרשימה.",
  },
  {
    question: "מה זה תגובה?",
    answer:
      "תגובה היא רשומת מידע שנוצרה מתוך טופס.\nכל פעם שמשתמש ממלא טופס ושומר אותו, נוצרת תגובה חדשה. לדוגמה: בטופס “תלמידים”, כל תלמיד שנוסף הוא תגובה. ",
  },
  {
    question: "איך יוצרים טופס?",
    answer: "נכנסים למסך הטפסים, יוצרים טופס חדש, מגדירים שם, שדות וסוגי שדות, ושומרים.",
  },
  {
    question: "איך יוצרים תגובה?",
    answer: "נכנסים לטופס הרצוי, לוחצים על יצירת תגובה, ממלאים את השדות ושומרים.",
  },
  {
    question: "מה אפשר לעשות אחרי יצירת טופס?",
    answer:
      "אפשר ליצור תגובות, לערוך את הטופס, להגדיר הרשאות, לשתף, לייבא/לייצא מידע ולצפות בתגובות בטבלה.",
  },
  {
    question: "מאיפה מקבלים את המידע?",
    answer:
      "אפשר לראות את המידע בטבלת התגובות במערכת, לייצא לאקסל, או לצרוך אותו דרך Oasis ו-Flow.",
  },
  {
    question: "מה זה טופס מקושר?",
    answer:
      "זה מנגנון שמאפשר להוסיף תגובות מטופס אחד מתוך תגובה בטופס אחר.\nלדוגמה: מתוך כיתה אפשר להוסיף תלמידים.",
  },
  {
    question: "אילו הרשאות קיימות?",
    answer:
      "קיימות הרשאות כמו שליטה מלאה, ניהול תגובות, ניהול ללא מחיקה, צפייה בלבד, יצירה בלבד, ויצירה וצפייה בתגובות שלי בלבד.",
  },
  {
    question: "מה זה מקטע?",
    answer: "מקטע הוא חלוקה פנימית בטופס שמסדרת שדות לפי נושא, למשל “פרטים אישיים” או “מסמכים”.",
  },
  {
    question: "אפשר לעשות תלות בין אפשרויות?",
    answer:
      "כן. אפשר להגדיר שאפשרויות בשדה אחד ישפיעו על האפשרויות בשדה אחר.\nלדוגמה: בחירת מדינה תשפיע על רשימת הערים.",
  },
];
